In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\brije\anaconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\brije\anaconda3\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\brije\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\brije\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\brije\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\brije\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
# CREATING A TABLE USING PANDA LIBRARY
import pandas as pd
data = {
    "Name": ["Akash", "Aditya","Anil","Chandan"],
    "Age":[21,22,21,23],
    "Course":["BCA","BCA","BCA","BCA"],
    "Language":["PYTHON","JAVA","JAVA","PYTHON"],
    "Marks":[90,85,43,67]
}
df= pd.DataFrame(data)


df.shape
df.head()
df.info()
df.tail()
df.columns
# df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Age       4 non-null      int64
 2   Course    4 non-null      object
 3   Language  4 non-null      object
 4   Marks     4 non-null      int64
dtypes: int64(2), object(3)
memory usage: 292.0+ bytes

Index(['Name', 'Age', 'Course', 'Language', 'Marks'], dtype='object')

In [36]:
# SELECT THE SINGLE COLUMNS
df["Name"]

0      Akash
1     Aditya
2       Anil
3    Chandan
Name: Name, dtype: object

In [37]:
# SELECT THE MULTIPLE COLUMNS
df[["Name","Language"]]

      Name Language
0    Akash   PYTHON
1   Aditya     JAVA
2     Anil     JAVA
3  Chandan   PYTHON

In [43]:
# select by the row [ index,position ]
df.loc[0]
df.iloc[0]

Name         Akash
Age             21
Course         BCA
Language    PYTHON
Name: 0, dtype: object

In [55]:
# FILTER THE TABLES
df[df[ "Marks" ] >= 85]
df[(df["Marks"] > 20 ) & (df["Marks"] < 85)]

      Name  Age Course Language  Marks
2     Anil   21    BCA     JAVA     43
3  Chandan   23    BCA   PYTHON     67

In [19]:
data = {
    "Order id":[101,102,103,104],
    "Product":["Pen", " Pencil","Copy","Rubber"],
    "Quantity":[100,200,300,400],
    "Price":[10,5,40,2]
}
df=pd.DataFrame(data)
# df.info()
# df.head()
# df["Quantity"]
# df[["Product","Order id"]]
df.describe()

         Order id    Quantity      Price
count    4.000000    4.000000   4.000000
mean   102.500000  250.000000  14.250000
std      1.290994  129.099445  17.480942
min    101.000000  100.000000   2.000000
25%    101.750000  175.000000   4.250000
50%    102.500000  250.000000   7.500000
75%    103.250000  325.000000  17.500000
max    104.000000  400.000000  40.000000

In [11]:
import mysql.connector
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="library_db",
    port=3306
)
cursor = conn.cursor()
cursor.execute("""
UPDATE books
SET issued_to = %s
WHERE id = %s
""",("rahul sharma",3))
conn.commit()
print(" issued_to updated")

 issued_to updated

In [3]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\brije\anaconda3\lib\site-packages (9.5.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import mysql.connector
print(mysql.connector.__version__)

9.5.0

In [4]:
import sys
sys.executable

'C:\\Users\\brije\\anaconda3\\python.exe'

In [12]:
import pandas as pd
query = "SELECT * FROM books "
df=pd.read_sql(query,conn)
df.head()

C:\Users\brije\AppData\Local\Temp\ipykernel_972\769260257.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql(query,conn)

,id,title,author,category,quantity,issued,issued_to,due_date
0,1,Java Programming,James Gosling,Programming,5,0,None,None
1,2,Database Systems,C.J. Date,Database,3,0,None,None
2,3,Operating System,Galvin,Computer Science,4,0,rahul sharma,None
3,4,Python for Beginners,John Smith,Programming,6,0,None,None
4,5,Data Structures,Mark Allen,Computer Science,5,0,None,None

In [6]:
df["title"]

0        Java Programming
1        Database Systems
2        Operating System
3    Python for Beginners
4         Data Structures
5                  python
Name: title, dtype: object

In [13]:
import pandas as pd
query = "SELECT * FROM books "
df=pd.read_sql(query,conn)
df.head()

C:\Users\brije\AppData\Local\Temp\ipykernel_972\769260257.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql(query,conn)

,id,title,author,category,quantity,issued,issued_to,due_date
0,1,Java Programming,James Gosling,Programming,5,0,None,None
1,2,Database Systems,C.J. Date,Database,3,0,None,None
2,3,Operating System,Galvin,Computer Science,4,0,rahul sharma,None
3,4,Python for Beginners,John Smith,Programming,6,0,None,None
4,5,Data Structures,Mark Allen,Computer Science,5,0,None,None

In [15]:
cursor.execute("""
UPDATE books
SET issued = %s
WHERE id = %s
""",(1,0))
conn.commit()
print(" issued successfully")

 issued successfully

In [38]:
import pandas as pd
query = "select * from books"
df=pd.read_sql(query,conn)
df.head()

C:\Users\brije\AppData\Local\Temp\ipykernel_972\2452594034.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql(query,conn)

,id,title,author,category,quantity,issued,issued_to,due_date
0,1,Java Programming,James Gosling,Programming,5,0,None,None
1,2,Database Systems,C.J. Date,Database,3,0,None,None
2,3,Operating System,Galvin,Computer Science,4,0,rahul sharma,None
3,4,Python for Beginners,John Smith,Programming,6,0,None,None
4,5,Data Structures,Mark Allen,Computer Science,5,0,None,None

In [39]:
cursor.close()

AttributeError: 'NoneType' object has no attribute 'close'

In [23]:
conn.close()

In [8]:
import mysql.connector
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password= "",
    database="library_db"
)
cursor=conn.connect()
print(" connect successfully")

 connect successfully

In [9]:
import pandas as pd
df= pd.read_sql(" select * from books",conn)
df

C:\Users\brije\AppData\Local\Temp\ipykernel_33800\537031853.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df= pd.read_sql(" select * from books",conn)

,id,title,author,category,quantity,issued,issued_to,due_date
0,1,Java Programming,James Gosling,Programming,5,0,None,None
1,2,Database Systems,C.J. Date,Database,3,0,None,None
2,3,Operating System,Galvin,Computer Science,4,0,rahul sharma,None
3,4,Python for Beginners,John Smith,Programming,6,0,None,None
4,5,Data Structures,Mark Allen,Computer Science,5,0,None,None
5,6,python,akash yadav,programing,5,0,None,None

In [13]:
import pandas as pd
df= pd.read_sql(" select * from users",conn)
df

C:\Users\brije\AppData\Local\Temp\ipykernel_33800\1568559416.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df= pd.read_sql(" select * from users",conn)

   id username  password     role
0   1    admin  admin123    admin
1   2    akash      1234  student
2   3  brijesh      1234  student
3   4    rahul      1234  student

In [14]:
# conn.close()
# conn.close()

AttributeError: 'NoneType' object has no attribute 'close'

In [29]:
import mysql.connector
conn= mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="quiz_db"
)
cursor = conn.connect()
print(" connect successfully")

 connect successfully

In [30]:
import pandas as pd
df=pd.read_sql(" select * from users",conn)
df

C:\Users\brije\AppData\Local\Temp\ipykernel_33800\2134714846.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql(" select * from users",conn)

   id  username              email password_hash  is_admin          created_at
0   1     admin  admin@example.com      admin123         1 2025-11-15 01:12:41
1   2     akash  akash@example.com      akash123         0 2025-11-15 01:12:41
2   3  student1     s1@example.com          s123         0 2025-11-15 01:12:41
3   4  student2     s2@example.com          s234         0 2025-11-15 01:12:41

In [31]:
import pandas as pd
df = pd.read_sql(" select * from questions",conn)
df

C:\Users\brije\AppData\Local\Temp\ipykernel_33800\1945688062.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(" select * from questions",conn)

,id,question_text,option_a,option_b,option_c,option_d,correct_option,category_id
0,1,2+2=?,2,3,4,5,C,1
1,2,5*5=?,10,25,15,20,B,1
2,3,Water formula?,H2O,CO2,O2,H2,A,2
3,4,Sun is a?,Planet,Star,Moon,Comet,B,2

In [65]:
import pandas as pd 
df= pd.read_csv("customer.csv")
# df.isnull().sum()
# df.fidllna(0)
# df.dropna()
# df.rename(columns={"Customer Id" : " ID"}, inplace=True)
df["Full Name"] = df["First Name"] + " " + df["Last Name"]


df

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website,Full Name
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/,Sheryl Baxter
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/,Preston Lozano
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/,Roy Berry
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/,Linda Olsen
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/,Joanna Bender
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/,Karl Greer
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/,Lynn Atkinson
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/,Fred Guerra
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/,Yvonne Farmer
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/,Clarence Haynes

In [16]:
df.shape

(100, 12)

In [64]:
df

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

In [67]:
# Remove FullName column and store it
fullname = df.pop("Full Name")

# Insert it back at index 2
df.insert(2, "Full Name", fullname)

df

,Index,Customer Id,Full Name,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl Baxter,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston Lozano,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy Berry,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda Olsen,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna Bender,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl Greer,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn Atkinson,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred Guerra,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne Farmer,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
99,100,2354a0E336A91A1,Clarence Haynes,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

In [32]:
import pandas as pd
df=pd.read_csv("ipl.csv")

df

C:\Users\brije\AppData\Local\Temp\ipykernel_3648\1576376294.py:2: DtypeWarning: Columns (28,29,30,31,43,46,47,48,51) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv("ipl.csv")

,Unnamed: 0,match_id,date,match_type,event_name,innings,batting_team,bowling_team,over,ball,...,team_runs,team_balls,team_wicket,new_batter,batter_runs,batter_balls,bowler_wicket,batting_partners,next_batter,striker_out
0,131970,335982,2008-04-18,T20,Indian Premier League,1,Kolkata Knight Riders,Royal Challengers Bangalore,0,1,...,1,1,0,NaN,0,1,0,"('BB McCullum', 'SC Ganguly')",NaN,False
1,131971,335982,2008-04-18,T20,Indian Premier League,1,Kolkata Knight Riders,Royal Challengers Bangalore,0,2,...,1,2,0,NaN,0,1,0,"('BB McCullum', 'SC Ganguly')",NaN,False
2,131972,335982,2008-04-18,T20,Indian Premier League,1,Kolkata Knight Riders,Royal Challengers Bangalore,0,3,...,2,2,0,NaN,0,1,0,"('BB McCullum', 'SC Ganguly')",NaN,False
3,131973,335982,2008-04-18,T20,Indian Premier League,1,Kolkata Knight Riders,Royal Challengers Bangalore,0,3,...,2,3,0,NaN,0,2,0,"('BB McCullum', 'SC Ganguly')",NaN,False
4,131974,335982,2008-04-18,T20,Indian Premier League,1,Kolkata Knight Riders,Royal Challengers Bangalore,0,4,...,2,4,0,NaN,0,3,0,"('BB McCullum', 'SC Ganguly')",NaN,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
278200,277951,1473511,2025-06-03,T20,Indian Premier League,2,Punjab Kings,Royal Challengers Bengaluru,19,2,...,162,116,7,NaN,39,26,0,"('KA Jamieson', 'Shashank Singh')",NaN,False
278201,277952,1473511,2025-06-03,T20,Indian Premier League,2,Punjab Kings,Royal Challengers Bengaluru,19,3,...,168,117,7,NaN,45,27,0,"('KA Jamieson', 'Shashank Singh')",NaN,False
278202,277953,1473511,2025-06-03,T20,Indian Premier League,2,Punjab Kings,Royal Challengers Bengaluru,19,4,...,172,118,7,NaN,49,28,0,"('KA Jamieson', 'Shashank Singh')",NaN,False
278203,277954,1473511,2025-06-03,T20,Indian Premier League,2,Punjab Kings,Royal Challengers Bengaluru,19,5,...,178,119,7,NaN,55,29,0,"('KA Jamieson', 'Shashank Singh')",NaN,False
278204,277955,1473511,2025-06-03,T20,Indian Premier League,2,Punjab Kings,Royal Challengers Bengaluru,19,6,...,184,120,7,NaN,61,30,0,"('KA Jamieson', 'Shashank Singh')",NaN,False

In [39]:
# JUST FOR INFO

# df.head()
df.info



# IF WE WANT TO RENAME COLUMNS MORE THAN ONE
# df.rename(columns={"match_id": "Match_Id",
#                   "match_type":"Match_Type",
#                    "event_name":"Event_Name"          
#                   }, inplace=True)
# df


# # IF WE WANT TO CHANGE FIRST LETTER OF EVERY COLUMMNS IS CAPITAL
# df.columns=df.columns.str.title()
# df

<bound method DataFrame.info of         Unnamed: 0  Match_Id        Date Match_Type             Event_Name  \
0           131970    335982  2008-04-18        T20  Indian Premier League
1           131971    335982  2008-04-18        T20  Indian Premier League
2           131972    335982  2008-04-18        T20  Indian Premier League
3           131973    335982  2008-04-18        T20  Indian Premier League
4           131974    335982  2008-04-18        T20  Indian Premier League
...            ...       ...         ...        ...                    ...
278200      277951   1473511  2025-06-03        T20  Indian Premier League
278201      277952   1473511  2025-06-03        T20  Indian Premier League
278202      277953   1473511  2025-06-03        T20  Indian Premier League
278203      277954   1473511  2025-06-03        T20  Indian Premier League
278204      277955   1473511  2025-06-03        T20  Indian Premier League

        Innings           Batting_Team                 Bowling_Team  Over  \
0             1  Kolkata Knight Riders  Royal Challengers Bangalore     0
1             1  Kolkata Knight Riders  Royal Challengers Bangalore     0
2             1  Kolkata Knight Riders  Royal Challengers Bangalore     0
3             1  Kolkata Knight Riders  Royal Challengers Bangalore     0
4             1  Kolkata Knight Riders  Royal Challengers Bangalore     0
...         ...                    ...                          ...   ...
278200        2           Punjab Kings  Royal Challengers Bengaluru    19
278201        2           Punjab Kings  Royal Challengers Bengaluru    19
278202        2           Punjab Kings  Royal Challengers Bengaluru    19
278203        2           Punjab Kings  Royal Challengers Bengaluru    19
278204        2           Punjab Kings  Royal Challengers Bengaluru    19

        Ball  ...  Team_Runs Team_Balls  Team_Wicket  New_Batter  Batter_Runs  \
0          1  ...          1          1            0         NaN            0
1          2  ...          1          2            0         NaN            0
2          3  ...          2          2            0         NaN            0
3          3  ...          2          3            0         NaN            0
4          4  ...          2          4            0         NaN            0
...      ...  ...        ...        ...          ...         ...          ...
278200     2  ...        162        116            7         NaN           39
278201     3  ...        168        117            7         NaN           45
278202     4  ...        172        118            7         NaN           49
278203     5  ...        178        119            7         NaN           55
278204     6  ...        184        120            7         NaN           61

       Batter_Balls  Bowler_Wicket                   Batting_Partners  \
0                 1              0      ('BB McCullum', 'SC Ganguly')
1                 1              0      ('BB McCullum', 'SC Ganguly')
2                 1              0      ('BB McCullum', 'SC Ganguly')
3                 2              0      ('BB McCullum', 'SC Ganguly')
4                 3              0      ('BB McCullum', 'SC Ganguly')
...             ...            ...                                ...
278200           26              0  ('KA Jamieson', 'Shashank Singh')
278201           27              0  ('KA Jamieson', 'Shashank Singh')
278202           28              0  ('KA Jamieson', 'Shashank Singh')
278203           29              0  ('KA Jamieson', 'Shashank Singh')
278204           30              0  ('KA Jamieson', 'Shashank Singh')

        Next_Batter  Striker_Out
0               NaN        False
1               NaN        False
2               NaN        False
3               NaN        False
4               NaN        False
...             ...          ...
278200          NaN        False
278201          NaN        False
278202          NaN        False
278203          NaN        False
278204          NaN        False

[278205 rows x 64 columns]>

In [24]:
df.isnull().sum()

Unnamed: 0               0
Match_Id                 0
Date                     0
Match_Type               0
Event_Name               0
                     ...
Batter_Balls             0
Bowler_Wicket            0
Batting_Partners         0
Next_Batter         264884
Striker_Out              0
Length: 64, dtype: int64

In [38]:
df.describe()

,Unnamed: 0,Match_Id,Innings,Over,Ball,Ball_No,Bat_Pos,Runs_Batter,Balls_Faced,Valid_Ball,...,Month,Year,Balls_Per_Over,Overs,Team_Runs,Team_Balls,Team_Wicket,Batter_Runs,Batter_Balls,Bowler_Wicket
count,278205.000000,2.782050e+05,278205.000000,278205.000000,278205.000000,278205.000000,278205.000000,278205.000000,278205.000000,278205.000000,...,278205.000000,278205.000000,278205.0,278205.0,278205.000000,278205.000000,278205.000000,278205.000000,278205.000000,278205.000000
mean,139102.000000,9.422687e+05,1.482914,9.193839,3.488855,9.542725,3.612555,1.277378,0.967362,0.963182,...,4.787933,2016.710178,6.0,20.0,77.110498,58.614637,2.456972,18.327424,14.011211,0.045470
std,80311.010157,3.817198e+05,0.502571,5.681511,1.708263,5.682938,2.168978,1.651107,0.177687,0.188315,...,1.586724,5.248572,0.0,0.0,49.957873,34.117619,2.100374,18.578093,11.833930,0.208333
min,0.000000,3.359820e+05,1.000000,0.000000,1.000000,0.100000,1.000000,0.000000,0.000000,0.000000,...,3.000000,2008.000000,6.0,20.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,69551.000000,5.483530e+05,1.000000,4.000000,2.000000,4.500000,2.000000,0.000000,1.000000,1.000000,...,4.000000,2012.000000,6.0,20.0,36.000000,29.000000,1.000000,4.000000,5.000000,0.000000
50%,139102.000000,1.082601e+06,1.000000,9.000000,3.000000,9.400000,3.000000,1.000000,1.000000,1.000000,...,4.000000,2017.000000,6.0,20.0,73.000000,58.000000,2.000000,12.000000,11.000000,0.000000
75%,208653.000000,1.304049e+06,2.000000,14.000000,5.000000,14.400000,5.000000,1.000000,1.000000,1.000000,...,5.000000,2022.000000,6.0,20.0,113.000000,88.000000,4.000000,27.000000,20.000000,0.000000
max,278204.000000,1.485779e+06,6.000000,19.000000,7.000000,19.600000,11.000000,6.000000,1.000000,1.000000,...,11.000000,2025.000000,6.0,20.0,287.000000,121.000000,10.000000,175.000000,73.000000,1.000000

In [40]:
# df.columns
df.drop("unnamed

Index(['Unnamed: 0', 'Match_Id', 'Date', 'Match_Type', 'Event_Name', 'Innings',
       'Batting_Team', 'Bowling_Team', 'Over', 'Ball', 'Ball_No', 'Batter',
       'Bat_Pos', 'Runs_Batter', 'Balls_Faced', 'Bowler', 'Valid_Ball',
       'Runs_Extras', 'Runs_Total', 'Runs_Bowler', 'Runs_Not_Boundary',
       'Extra_Type', 'Non_Striker', 'Non_Striker_Pos', 'Wicket_Kind',
       'Player_Out', 'Fielders', 'Runs_Target', 'Review_Batter',
       'Team_Reviewed', 'Review_Decision', 'Umpire', 'Umpires_Call',
       'Player_Of_Match', 'Match_Won_By', 'Win_Outcome', 'Toss_Winner',
       'Toss_Decision', 'Venue', 'City', 'Day', 'Month', 'Year', 'Season',
       'Gender', 'Team_Type', 'Superover_Winner', 'Result_Type', 'Method',
       'Balls_Per_Over', 'Overs', 'Event_Match_No', 'Stage', 'Match_Number',
       'Team_Runs', 'Team_Balls', 'Team_Wicket', 'New_Batter', 'Batter_Runs',
       'Batter_Balls', 'Bowler_Wicket', 'Batting_Partners', 'Next_Batter',
       'Striker_Out'],
      dtype='object')

In [ ]:
# PERFORMIMNG THE CALCULATION IN ROWS AND COLOMNS WE CAN USE THE THREE SPECIAL FUNCTION
# map() : it is usedd for performing the row calculation
# apply() : It is used for performing the columns calculation
# applymap() : It is used for overall calculation mean that apply allover the entire data of row and columns

In [66]:

import pandas as pd
df=pd.read_excel("Raw Data .xlsx")
df

    Id      Name  Lastname  Salary Department  Mobile no.
0    1     Anshu    Rajput   90000      Sales  8595787610
1    2    Manish     Kumar   62000  Marketing  8595787611
2    3     Aadil      Khan   70000    Finance  8595787612
3    4   Chandan    Thakur   80000         IT  8595787613
4    5      Aman     Anand   20000      Sales  8595787614
5    6     Badal     Singh   65000  Marketing  8595787615
6    7      Anil     Yadav   55000    Finance  8595787616
7    8     Akash     Verma   75000         IT  8595787617
8    9      Yash  Kushwaha   25000      Sales  8595787618
9   10  Abhishek     Yadav   95000  Marketing  8595787619
10  11   Aaditya     Yadav   10000    Finance  8595787620
11  12     Daksh   Chauhan   66000         IT  8595787621
12  13     Ayush     Singh   30000      Sales  8595787622
13  14      Arun     Singh   89000  Marketing  8595787623
14  15    Ashish     Rawat   90000    Finance  8595787624
15  16    Shivam    Thakur   91000         IT  8595787625
16  17     Swati    Thakur   92000      Sales  8595787626
17  18    Vineet      Ojha   93000  Marketing  8595787627
18  19    Sourav    Mathur   94000    Finance  8595787628
19  20    Yogesh    Sharma   95000         IT  8595787629

In [ ]:
# JOIN IN PANDAS
# left join :It can show the full left side data and compare with right side data
# right join : It can show the full right side data  and compare with left side data.
# inner join : It can shiw the common data in both left and  right side data.
# outer join : It can show the overall comparison  of left and right both side data at a time.

In [117]:



one=pd.DataFrame( {
 "id":[1,2,3,4],
    "Name": ["Akash", "Aditya","Anil","Chandan"],
}) 
one

   id     Name
0   1    Akash
1   2   Aditya
2   3     Anil
3   4  Chandan

In [114]:
two= pd.DataFrame( {
    "id": [6,7,3,4],
   
    "Sub_id":["sub1","sub2","sub3","sub4"]
})
two

   id Sub_id
0   6   sub1
1   7   sub2
2   3   sub3
3   4   sub4

In [109]:
import pandas as pd

df1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Akash', 'Ravi', 'Neha', 'Pooja']
})

df2 = pd.DataFrame({
    'id': [3, 4, 5],
    'marks': [85, 90, 88]
})
pd.merge(df1, df2, on='id', how='inner')

   id   name  marks
0   3   Neha     85
1   4  Pooja     90

In [ ]:
======================= PRACTICE ON CSV FILE i.e CRIME DATASET INDIA ===============================================

In [2]:
import pandas as pd
df=pd.read_csv(r"C:\Users\brije\OneDrive\Documents\Desktop\crime_dataset_india.csv")
df

,Report Number,Date Reported,Date of Occurrence,Time of Occurrence,City,Crime Code,Crime Description,Victim Age,Victim Gender,Weapon Used,Crime Domain,Police Deployed,Case Closed,Date Case Closed
0,1,02-01-2020 00:00,01-01-2020 00:00,01-01-2020 01:11,Ahmedabad,576,IDENTITY THEFT,16,M,Blunt Object,Violent Crime,13,No,NaN
1,2,01-01-2020 19:00,01-01-2020 01:00,01-01-2020 06:26,Chennai,128,HOMICIDE,37,M,Poison,Other Crime,9,No,NaN
2,3,02-01-2020 05:00,01-01-2020 02:00,01-01-2020 14:30,Ludhiana,271,KIDNAPPING,48,F,Blunt Object,Other Crime,15,No,NaN
3,4,01-01-2020 05:00,01-01-2020 03:00,01-01-2020 14:46,Pune,170,BURGLARY,49,F,Firearm,Other Crime,1,Yes,29-04-2020 05:00
4,5,01-01-2020 21:00,01-01-2020 04:00,01-01-2020 16:51,Pune,421,VANDALISM,30,F,Other,Other Crime,18,Yes,08-01-2020 21:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40155,40156,01-08-2024 16:00,07-31-2024 03:00,31-07-2024 05:05,Kolkata,312,COUNTERFEITING,78,F,Firearm,Other Crime,12,No,NaN
40156,40157,31-07-2024 14:00,07-31-2024 04:00,31-07-2024 04:14,Mumbai,300,ILLEGAL POSSESSION,75,F,NaN,Other Crime,2,Yes,29-09-2024 14:00
40157,40158,02-08-2024 03:00,07-31-2024 05:00,31-07-2024 21:33,Kanpur,423,VEHICLE - STOLEN,68,M,Other,Violent Crime,6,No,NaN
40158,40159,01-08-2024 19:00,07-31-2024 06:00,31-07-2024 11:05,Patna,311,SEXUAL ASSAULT,11,M,Blunt Object,Violent Crime,1,No,NaN
40159,40160,31-07-2024 17:00,07-31-2024 07:00,31-07-2024 17:19,Delhi,193,DOMESTIC VIOLENCE,43,F,Poison,Violent Crime,7,Yes,28-09-2024 17:00

In [16]:
df.shape

(40160, 14)

In [15]:
df.columns

Index(['Report Number', 'Date Reported', 'Date of Occurrence',
       'Time of Occurrence', 'City', 'Crime Code', 'Crime Description',
       'Victim Age', 'Victim Gender', 'Weapon Used', 'Crime Domain',
       'Police Deployed', 'Case Closed', 'Date Case Closed'],
      dtype='object')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40160 entries, 0 to 40159
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Report Number       40160 non-null  int64
 1   Date Reported       40160 non-null  object
 2   Date of Occurrence  40160 non-null  object
 3   Time of Occurrence  40160 non-null  object
 4   City                40160 non-null  object
 5   Crime Code          40160 non-null  int64
 6   Crime Description   40160 non-null  object
 7   Victim Age          40160 non-null  int64
 8   Victim Gender       40160 non-null  object
 9   Weapon Used         34370 non-null  object
 10  Crime Domain        40160 non-null  object
 11  Police Deployed     40160 non-null  int64
 12  Case Closed         40160 non-null  object
 13  Date Case Closed    20062 non-null  object
dtypes: int64(4), object(10)
memory usage: 4.3+ MB

In [18]:
df.head(10)

,Report Number,Date Reported,Date of Occurrence,Time of Occurrence,City,Crime Code,Crime Description,Victim Age,Victim Gender,Weapon Used,Crime Domain,Police Deployed,Case Closed,Date Case Closed
0,1,02-01-2020 00:00,01-01-2020 00:00,01-01-2020 01:11,Ahmedabad,576,IDENTITY THEFT,16,M,Blunt Object,Violent Crime,13,No,NaN
1,2,01-01-2020 19:00,01-01-2020 01:00,01-01-2020 06:26,Chennai,128,HOMICIDE,37,M,Poison,Other Crime,9,No,NaN
2,3,02-01-2020 05:00,01-01-2020 02:00,01-01-2020 14:30,Ludhiana,271,KIDNAPPING,48,F,Blunt Object,Other Crime,15,No,NaN
3,4,01-01-2020 05:00,01-01-2020 03:00,01-01-2020 14:46,Pune,170,BURGLARY,49,F,Firearm,Other Crime,1,Yes,29-04-2020 05:00
4,5,01-01-2020 21:00,01-01-2020 04:00,01-01-2020 16:51,Pune,421,VANDALISM,30,F,Other,Other Crime,18,Yes,08-01-2020 21:00
5,6,02-01-2020 03:00,01-01-2020 05:00,01-01-2020 17:09,Delhi,442,ASSAULT,16,M,Firearm,Violent Crime,18,Yes,30-03-2020 03:00
6,7,01-01-2020 16:00,01-01-2020 06:00,01-01-2020 14:08,Chennai,172,VEHICLE - STOLEN,64,F,Knife,Violent Crime,13,Yes,24-03-2020 16:00
7,8,02-01-2020 10:00,01-01-2020 07:00,02-01-2020 06:33,Chennai,169,COUNTERFEITING,78,X,Knife,Other Crime,8,No,NaN
8,9,04-01-2020 03:00,01-01-2020 08:00,02-01-2020 06:34,Mumbai,338,EXTORTION,41,X,Blunt Object,Other Crime,1,No,NaN
9,10,03-01-2020 07:00,01-01-2020 09:00,01-01-2020 17:50,Chennai,497,PUBLIC INTOXICATION,29,M,Knife,Other Crime,4,No,NaN

In [22]:
df['Victim Age'].describe()

count    40160.00000
mean        44.49126
std         20.22555
min         10.00000
25%         27.00000
50%         44.00000
75%         62.00000
max         79.00000
Name: Victim Age, dtype: float64

In [33]:
# df[df['City']=='Delhi']
df[df['City']== 'Mumbai']

,Report Number,Date Reported,Date of Occurrence,Time of Occurrence,City,Crime Code,Crime Description,Victim Age,Victim Gender,Weapon Used,Crime Domain,Police Deployed,Case Closed,Date Case Closed
8,9,04-01-2020 03:00,01-01-2020 08:00,02-01-2020 06:34,Mumbai,338,EXTORTION,41,X,Blunt Object,Other Crime,1,No,NaN
13,14,02-01-2020 22:00,01-01-2020 13:00,01-01-2020 17:46,Mumbai,436,ASSAULT,32,X,NaN,Violent Crime,18,No,NaN
21,22,03-01-2020 12:00,01-01-2020 21:00,02-01-2020 10:11,Mumbai,374,VANDALISM,64,F,Other,Other Crime,15,Yes,03-03-2020 12:00
39,40,03-01-2020 02:00,01-02-2020 15:00,03-01-2020 14:05,Mumbai,154,FRAUD,69,F,Explosives,Other Crime,10,Yes,15-01-2020 02:00
43,44,04-01-2020 07:00,01-02-2020 19:00,03-01-2020 08:34,Mumbai,300,SEXUAL ASSAULT,44,M,Other,Violent Crime,7,No,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40145,40146,31-07-2024 22:00,07-30-2024 17:00,31-07-2024 00:01,Mumbai,539,FIREARM OFFENSE,11,M,Explosives,Fire Accident,18,No,NaN
40149,40150,31-07-2024 19:00,07-30-2024 21:00,31-07-2024 15:43,Mumbai,161,PUBLIC INTOXICATION,37,M,Other,Other Crime,8,Yes,16-08-2024 19:00
40150,40151,01-08-2024 23:00,07-30-2024 22:00,31-07-2024 19:41,Mumbai,430,TRAFFIC VIOLATION,47,F,Knife,Traffic Fatality,6,No,NaN
40151,40152,01-08-2024 00:00,07-30-2024 23:00,30-07-2024 23:10,Mumbai,106,KIDNAPPING,42,F,NaN,Other Crime,1,Yes,25-10-2024 00:00
40156,40157,31-07-2024 14:00,07-31-2024 04:00,31-07-2024 04:14,Mumbai,300,ILLEGAL POSSESSION,75,F,NaN,Other Crime,2,Yes,29-09-2024 14:00

In [40]:
# df[df["Victim Gender"]== "M"]
# df[df["Victim Gender"]== "M"].count()
df[df['Victim Gender']== 'F']

,Report Number,Date Reported,Date of Occurrence,Time of Occurrence,City,Crime Code,Crime Description,Victim Age,Victim Gender,Weapon Used,Crime Domain,Police Deployed,Case Closed,Date Case Closed
2,3,02-01-2020 05:00,01-01-2020 02:00,01-01-2020 14:30,Ludhiana,271,KIDNAPPING,48,F,Blunt Object,Other Crime,15,No,NaN
3,4,01-01-2020 05:00,01-01-2020 03:00,01-01-2020 14:46,Pune,170,BURGLARY,49,F,Firearm,Other Crime,1,Yes,29-04-2020 05:00
4,5,01-01-2020 21:00,01-01-2020 04:00,01-01-2020 16:51,Pune,421,VANDALISM,30,F,Other,Other Crime,18,Yes,08-01-2020 21:00
6,7,01-01-2020 16:00,01-01-2020 06:00,01-01-2020 14:08,Chennai,172,VEHICLE - STOLEN,64,F,Knife,Violent Crime,13,Yes,24-03-2020 16:00
12,13,01-01-2020 16:00,01-01-2020 12:00,01-01-2020 23:14,Visakhapatnam,498,FRAUD,36,F,Poison,Other Crime,3,Yes,29-02-2020 16:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40153,40154,31-07-2024 17:00,07-31-2024 01:00,31-07-2024 21:42,Kolkata,567,PUBLIC INTOXICATION,71,F,Blunt Object,Other Crime,14,Yes,22-08-2024 17:00
40154,40155,01-08-2024 11:00,07-31-2024 02:00,31-07-2024 12:59,Chennai,532,COUNTERFEITING,50,F,Explosives,Other Crime,2,No,NaN
40155,40156,01-08-2024 16:00,07-31-2024 03:00,31-07-2024 05:05,Kolkata,312,COUNTERFEITING,78,F,Firearm,Other Crime,12,No,NaN
40156,40157,31-07-2024 14:00,07-31-2024 04:00,31-07-2024 04:14,Mumbai,300,ILLEGAL POSSESSION,75,F,NaN,Other Crime,2,Yes,29-09-2024 14:00
40159,40160,31-07-2024 17:00,07-31-2024 07:00,31-07-2024 17:19,Delhi,193,DOMESTIC VIOLENCE,43,F,Poison,Violent Crime,7,Yes,28-09-2024 17:00

In [45]:
# df[df['Victim Age']<=30]
df[df["Victim Age"]>30]

,Report Number,Date Reported,Date of Occurrence,Time of Occurrence,City,Crime Code,Crime Description,Victim Age,Victim Gender,Weapon Used,Crime Domain,Police Deployed,Case Closed,Date Case Closed
1,2,01-01-2020 19:00,01-01-2020 01:00,01-01-2020 06:26,Chennai,128,HOMICIDE,37,M,Poison,Other Crime,9,No,NaN
2,3,02-01-2020 05:00,01-01-2020 02:00,01-01-2020 14:30,Ludhiana,271,KIDNAPPING,48,F,Blunt Object,Other Crime,15,No,NaN
3,4,01-01-2020 05:00,01-01-2020 03:00,01-01-2020 14:46,Pune,170,BURGLARY,49,F,Firearm,Other Crime,1,Yes,29-04-2020 05:00
6,7,01-01-2020 16:00,01-01-2020 06:00,01-01-2020 14:08,Chennai,172,VEHICLE - STOLEN,64,F,Knife,Violent Crime,13,Yes,24-03-2020 16:00
7,8,02-01-2020 10:00,01-01-2020 07:00,02-01-2020 06:33,Chennai,169,COUNTERFEITING,78,X,Knife,Other Crime,8,No,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40154,40155,01-08-2024 11:00,07-31-2024 02:00,31-07-2024 12:59,Chennai,532,COUNTERFEITING,50,F,Explosives,Other Crime,2,No,NaN
40155,40156,01-08-2024 16:00,07-31-2024 03:00,31-07-2024 05:05,Kolkata,312,COUNTERFEITING,78,F,Firearm,Other Crime,12,No,NaN
40156,40157,31-07-2024 14:00,07-31-2024 04:00,31-07-2024 04:14,Mumbai,300,ILLEGAL POSSESSION,75,F,NaN,Other Crime,2,Yes,29-09-2024 14:00
40157,40158,02-08-2024 03:00,07-31-2024 05:00,31-07-2024 21:33,Kanpur,423,VEHICLE - STOLEN,68,M,Other,Violent Crime,6,No,NaN
40159,40160,31-07-2024 17:00,07-31-2024 07:00,31-07-2024 17:19,Delhi,193,DOMESTIC VIOLENCE,43,F,Poison,Violent Crime,7,Yes,28-09-2024 17:00

In [52]:
df[(df['Victim Gender'] == 'Male') & (df['Case Closed'] == 'Yes')]

Empty DataFrame
Columns: [Report Number, Date Reported, Date of Occurrence, Time of Occurrence, City, Crime Code, Crime Description, Victim Age, Victim Gender, Weapon Used, Crime Domain, Police Deployed, Case Closed, Date Case Closed]
Index: []

In [3]:
# df[df["Weapon Used"]=="Knife"]
df[df["Weapon Used"]=="Knife"].count()

Report Number         5835
Date Reported         5835
Date of Occurrence    5835
Time of Occurrence    5835
City                  5835
Crime Code            5835
Crime Description     5835
Victim Age            5835
Victim Gender         5835
Weapon Used           5835
Crime Domain          5835
Police Deployed       5835
Case Closed           5835
Date Case Closed      2906
dtype: int64

In [67]:
df.sort_values(by="Victim Age",ascending=True).head(20)

,Report Number,Date Reported,Date of Occurrence,Time of Occurrence,City,Crime Code,Crime Description,Victim Age,Victim Gender,Weapon Used,Crime Domain,Police Deployed,Case Closed,Date Case Closed
28920,28921,22-04-2023 12:00,04-20-2023 00:00,20-04-2023 14:30,Bhopal,123,VEHICLE - STOLEN,10,F,NaN,Violent Crime,3,No,NaN
39453,39454,02-07-2024 06:00,07-01-2024 21:00,01-07-2024 21:05,Jaipur,493,PUBLIC INTOXICATION,10,F,Blunt Object,Other Crime,1,Yes,08-07-2024 06:00
34781,34782,21-12-2023 07:00,12-20-2023 05:00,20-12-2023 07:44,Surat,549,ARSON,10,F,Other,Fire Accident,5,Yes,09-01-2024 07:00
38146,38147,11-05-2024 08:00,05-08-2024 10:00,08-05-2024 23:44,Kanpur,577,COUNTERFEITING,10,F,Firearm,Other Crime,13,No,NaN
15570,15571,12-10-2021 00:00,10-10-2021 18:00,11-10-2021 02:08,Kolkata,258,CYBERCRIME,10,M,Poison,Other Crime,14,No,NaN
9144,9145,16-01-2021 03:00,01-16-2021 00:00,16-01-2021 22:29,Agra,176,COUNTERFEITING,10,F,Explosives,Other Crime,4,Yes,07-04-2021 03:00
20099,20100,19-04-2022 00:00,04-17-2022 11:00,17-04-2022 11:34,Delhi,416,FIREARM OFFENSE,10,F,Knife,Fire Accident,6,No,NaN
33346,33347,22-10-2023 05:00,10-21-2023 10:00,21-10-2023 22:25,Rajkot,317,SEXUAL ASSAULT,10,F,Blunt Object,Violent Crime,3,Yes,08-09-2024 05:00
14132,14133,11-08-2021 23:00,08-11-2021 20:00,12-08-2021 03:48,Mumbai,426,COUNTERFEITING,10,F,Knife,Other Crime,12,No,NaN
31370,31371,01-08-2023 07:00,07-31-2023 02:00,31-07-2023 12:32,Pune,369,TRAFFIC VIOLATION,10,F,Other,Traffic Fatality,17,Yes,05-08-2023 07:00
38992,38993,14-06-2024 09:00,06-12-2024 16:00,13-06-2024 08:24,Kolkata,435,KIDNAPPING,10,M,Knife,Other Crime,2,Yes,20-07-2024 09:00
25198,25199,17-11-2022 21:00,11-15-2022 22:00,16-11-2022 15:58,Bangalore,339,DRUG OFFENSE,10,M,Knife,Other Crime,17,No,NaN
20113,20114,20-04-2022 05:00,04-18-2022 01:00,18-04-2022 01:40,Agra,398,COUNTERFEITING,10,F,Blunt Object,Other Crime,1,No,NaN
28934,28935,22-04-2023 22:00,04-20-2023 14:00,21-04-2023 06:11,Chennai,220,FRAUD,10,F,Blunt Object,Other Crime,12,Yes,27-05-2023 22:00
5255,5256,09-08-2020 06:00,08-06-2020 23:00,07-08-2020 20:10,Mumbai,504,IDENTITY THEFT,10,M,Firearm,Violent Crime,9,Yes,06-11-2020 06:00
27092,27093,05-02-2023 04:00,02-02-2023 20:00,03-02-2023 04:52,Pune,459,EXTORTION,10,X,Poison,Other Crime,11,Yes,19-04-2023 04:00
33342,33343,23-10-2023 18:00,10-21-2023 06:00,22-10-2023 02:39,Chennai,122,IDENTITY THEFT,10,M,NaN,Violent Crime,19,No,NaN
31389,31390,02-08-2023 12:00,07-31-2023 21:00,01-08-2023 00:46,Kolkata,292,ASSAULT,10,F,Other,Violent Crime,6,Yes,25-10-2023 12:00
36836,36837,17-03-2024 07:00,03-14-2024 20:00,14-03-2024 20:34,Kanpur,168,VEHICLE - STOLEN,10,M,Firearm,Violent Crime,10,Yes,03-04-2024 07:00
38365,38366,19-05-2024 00:00,05-17-2024 13:00,17-05-2024 18:40,Kanpur,436,COUNTERFEITING,10,F,Firearm,Other Crime,15,Yes,29-06-2024 00:00

In [81]:
p=df["City"].value_counts()
pd.DataFrame(p)

               count
City
Delhi           5400
Mumbai          4415
Bangalore       3588
Hyderabad       2881
Kolkata         2518
Chennai         2493
Pune            2212
Ahmedabad       1817
Jaipur          1479
Lucknow         1456
Kanpur          1112
Surat           1111
Nagpur          1053
Agra             764
Ludhiana         761
Visakhapatnam    728
Thane            706
Ghaziabad        704
Indore           699
Patna            695
Bhopal           690
Meerut           395
Srinagar         371
Nashik           366
Vasai            362
Varanasi         355
Kalyan           355
Faridabad        354
Rajkot           320

In [99]:
# df["Crime Description"].value_counts().head(1)
# df['City'].value_counts().head(1)
df["Crime Description"].value_counts().head(1)

Crime Description
BURGLARY    1980
Name: count, dtype: int64

In [97]:
df["Crime Domain"].value_counts()

Crime Domain
Other Crime         22948
Violent Crime       11472
Fire Accident        3825
Traffic Fatality     1915
Name: count, dtype: int64

In [125]:
q=df[['City','Victim Age','Victim Gender']].value_counts()
q

City       Victim Age  Victim Gender
Delhi      35          F                62
           18          F                59
           30          F                58
           73          F                57
           48          F                55
                                        ..
Rajkot     21          M                 1
           19          F                 1
           18          F                 1
           17          M                 1
Ghaziabad  33          X                 1
Name: count, Length: 5371, dtype: int64

In [100]:
df["Weapon Used"].value_counts().head(5)

Weapon Used
Knife           5835
Explosives      5751
Blunt Object    5737
Poison          5728
Other           5676
Name: count, dtype: int64

In [102]:
df.groupby("City").size()

City
Agra              764
Ahmedabad        1817
Bangalore        3588
Bhopal            690
Chennai          2493
Delhi            5400
Faridabad         354
Ghaziabad         704
Hyderabad        2881
Indore            699
Jaipur           1479
Kalyan            355
Kanpur           1112
Kolkata          2518
Lucknow          1456
Ludhiana          761
Meerut            395
Mumbai           4415
Nagpur           1053
Nashik            366
Patna             695
Pune             2212
Rajkot            320
Srinagar          371
Surat            1111
Thane             706
Varanasi          355
Vasai             362
Visakhapatnam     728
dtype: int64

In [109]:
df.groupby("Victim Age").size()

Victim Age
10    571
11    606
12    534
13    574
14    542
     ...
75    565
76    607
77    555
78    596
79    597
Length: 70, dtype: int64

In [107]:
df.groupby("Victim Gender").size()

Victim Gender
F    22423
M    13405
X     4332
dtype: int64

In [118]:
df.groupby("City")["Victim Age"].mean()

City
Agra             43.691099
Ahmedabad        44.319207
Bangalore        44.658584
Bhopal           44.198551
Chennai          44.061372
Delhi            44.225370
Faridabad        45.867232
Ghaziabad        44.654830
Hyderabad        44.190212
Indore           43.811159
Jaipur           44.883029
Kalyan           45.214085
Kanpur           44.130396
Kolkata          44.720016
Lucknow          44.794643
Ludhiana         44.839685
Meerut           44.987342
Mumbai           44.326614
Nagpur           44.523267
Nashik           45.918033
Patna            44.752518
Pune             44.968807
Rajkot           43.693750
Srinagar         43.382749
Surat            44.806481
Thane            45.773371
Varanasi         44.526761
Vasai            45.433702
Visakhapatnam    44.285714
Name: Victim Age, dtype: float64

In [131]:
q=df.groupby("Crime Description")["Police Deployed"].max()
pd.DataFrame(q)

                     Police Deployed
Crime Description
ARSON                             19
ASSAULT                           19
BURGLARY                          19
COUNTERFEITING                    19
CYBERCRIME                        19
DOMESTIC VIOLENCE                 19
DRUG OFFENSE                      19
EXTORTION                         19
FIREARM OFFENSE                   19
FRAUD                             19
HOMICIDE                          19
IDENTITY THEFT                    19
ILLEGAL POSSESSION                19
KIDNAPPING                        19
PUBLIC INTOXICATION               19
ROBBERY                           19
SEXUAL ASSAULT                    19
SHOPLIFTING                       19
TRAFFIC VIOLATION                 19
VANDALISM                         19
VEHICLE - STOLEN                  19

In [134]:
# THERE IS TWO WAY TO CALCULATE COUNT
# df.groupby("Case Closed").size()
df["Case Closed"].value_counts()

Case Closed
No     20098
Yes    20062
Name: count, dtype: int64

In [149]:
def age_group(age):
    if age < 18:
        return "Minor"
    elif age <= 40:
        return "Adult"
    else:
        return "Senior"
df["Age Group"] = df["Victim Age"].apply(age_group)
df[["Victim Age","Age Group"]].head()

   Victim Age Age Group
0          16     Minor
1          37     Adult
2          48    Senior
3          49    Senior
4          30     Adult

In [150]:
df

,Report Number,Date Reported,Date of Occurrence,Time of Occurrence,City,Crime Code,Crime Description,Victim Age,Victim Gender,Weapon Used,Crime Domain,Police Deployed,Case Closed,Date Case Closed,Age Group
0,1,02-01-2020 00:00,01-01-2020 00:00,01-01-2020 01:11,Ahmedabad,576,IDENTITY THEFT,16,M,Blunt Object,Violent Crime,13,No,NaN,Minor
1,2,01-01-2020 19:00,01-01-2020 01:00,01-01-2020 06:26,Chennai,128,HOMICIDE,37,M,Poison,Other Crime,9,No,NaN,Adult
2,3,02-01-2020 05:00,01-01-2020 02:00,01-01-2020 14:30,Ludhiana,271,KIDNAPPING,48,F,Blunt Object,Other Crime,15,No,NaN,Senior
3,4,01-01-2020 05:00,01-01-2020 03:00,01-01-2020 14:46,Pune,170,BURGLARY,49,F,Firearm,Other Crime,1,Yes,29-04-2020 05:00,Senior
4,5,01-01-2020 21:00,01-01-2020 04:00,01-01-2020 16:51,Pune,421,VANDALISM,30,F,Other,Other Crime,18,Yes,08-01-2020 21:00,Adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40155,40156,01-08-2024 16:00,07-31-2024 03:00,31-07-2024 05:05,Kolkata,312,COUNTERFEITING,78,F,Firearm,Other Crime,12,No,NaN,Senior
40156,40157,31-07-2024 14:00,07-31-2024 04:00,31-07-2024 04:14,Mumbai,300,ILLEGAL POSSESSION,75,F,NaN,Other Crime,2,Yes,29-09-2024 14:00,Senior
40157,40158,02-08-2024 03:00,07-31-2024 05:00,31-07-2024 21:33,Kanpur,423,VEHICLE - STOLEN,68,M,Other,Violent Crime,6,No,NaN,Senior
40158,40159,01-08-2024 19:00,07-31-2024 06:00,31-07-2024 11:05,Patna,311,SEXUAL ASSAULT,11,M,Blunt Object,Violent Crime,1,No,NaN,Minor
40159,40160,31-07-2024 17:00,07-31-2024 07:00,31-07-2024 17:19,Delhi,193,DOMESTIC VIOLENCE,43,F,Poison,Violent Crime,7,Yes,28-09-2024 17:00,Senior

In [188]:
df["Case Status"]= df["Case Closed"].map({"Yes":1,"No":0})
df[["Case Closed","Case Status"]].head()

  Case Closed  Case Status
0          No            0
1          No            0
2          No            0
3         Yes            1
4         Yes            1

In [157]:
df

,Report Number,Date Reported,Date of Occurrence,Time of Occurrence,City,Crime Code,Crime Description,Victim Age,Victim Gender,Weapon Used,Crime Domain,Police Deployed,Case Closed,Date Case Closed,Age Group,Case Status,Case status
0,1,02-01-2020 00:00,01-01-2020 00:00,01-01-2020 01:11,Ahmedabad,576,IDENTITY THEFT,16,M,Blunt Object,Violent Crime,13,No,NaN,Minor,0,0
1,2,01-01-2020 19:00,01-01-2020 01:00,01-01-2020 06:26,Chennai,128,HOMICIDE,37,M,Poison,Other Crime,9,No,NaN,Adult,0,0
2,3,02-01-2020 05:00,01-01-2020 02:00,01-01-2020 14:30,Ludhiana,271,KIDNAPPING,48,F,Blunt Object,Other Crime,15,No,NaN,Senior,0,0
3,4,01-01-2020 05:00,01-01-2020 03:00,01-01-2020 14:46,Pune,170,BURGLARY,49,F,Firearm,Other Crime,1,Yes,29-04-2020 05:00,Senior,1,1
4,5,01-01-2020 21:00,01-01-2020 04:00,01-01-2020 16:51,Pune,421,VANDALISM,30,F,Other,Other Crime,18,Yes,08-01-2020 21:00,Adult,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40155,40156,01-08-2024 16:00,07-31-2024 03:00,31-07-2024 05:05,Kolkata,312,COUNTERFEITING,78,F,Firearm,Other Crime,12,No,NaN,Senior,0,0
40156,40157,31-07-2024 14:00,07-31-2024 04:00,31-07-2024 04:14,Mumbai,300,ILLEGAL POSSESSION,75,F,NaN,Other Crime,2,Yes,29-09-2024 14:00,Senior,1,1
40157,40158,02-08-2024 03:00,07-31-2024 05:00,31-07-2024 21:33,Kanpur,423,VEHICLE - STOLEN,68,M,Other,Violent Crime,6,No,NaN,Senior,0,0
40158,40159,01-08-2024 19:00,07-31-2024 06:00,31-07-2024 11:05,Patna,311,SEXUAL ASSAULT,11,M,Blunt Object,Violent Crime,1,No,NaN,Minor,0,0
40159,40160,31-07-2024 17:00,07-31-2024 07:00,31-07-2024 17:19,Delhi,193,DOMESTIC VIOLENCE,43,F,Poison,Violent Crime,7,Yes,28-09-2024 17:00,Senior,1,1

In [158]:
df.isnull().sum()

Report Number             0
Date Reported             0
Date of Occurrence        0
Time of Occurrence        0
City                      0
Crime Code                0
Crime Description         0
Victim Age                0
Victim Gender             0
Weapon Used            5790
Crime Domain              0
Police Deployed           0
Case Closed               0
Date Case Closed      20098
Age Group                 0
Case Status               0
Case status               0
dtype: int64

In [161]:
df['Victim Age'].fillna(df['Victim Age'].mean(), inplace=True)

C:\Users\brije\AppData\Local\Temp\ipykernel_30668\2809840026.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Victim Age'].fillna(df['Victim Age'].mean(), inplace=True)

In [172]:
df.duplicated().sum()

np.int64(0)

In [173]:
df.drop_duplicates(inplace=True)

In [176]:
df["City"].value_counts().idxmax()

'Delhi'

In [178]:
df[df["Victim Gender"]=="F"]["Crime Description"].value_counts().head(1)

Crime Description
VANDALISM    1144
Name: count, dtype: int64

In [182]:
(df["Case Closed"]=="Yes").mean()*100

np.float64(49.95517928286853)

In [183]:
df["Police Deployed"].mean()

np.float64(10.00625)

In [186]:
del df["Case status"]

In [190]:
df

,Report Number,Date Reported,Date of Occurrence,Time of Occurrence,City,Crime Code,Crime Description,Victim Age,Victim Gender,Weapon Used,Crime Domain,Police Deployed,Case Closed,Date Case Closed,Age Group,Case Status
0,1,02-01-2020 00:00,01-01-2020 00:00,01-01-2020 01:11,Ahmedabad,576,IDENTITY THEFT,16,M,Blunt Object,Violent Crime,13,No,NaN,Minor,0
1,2,01-01-2020 19:00,01-01-2020 01:00,01-01-2020 06:26,Chennai,128,HOMICIDE,37,M,Poison,Other Crime,9,No,NaN,Adult,0
2,3,02-01-2020 05:00,01-01-2020 02:00,01-01-2020 14:30,Ludhiana,271,KIDNAPPING,48,F,Blunt Object,Other Crime,15,No,NaN,Senior,0
3,4,01-01-2020 05:00,01-01-2020 03:00,01-01-2020 14:46,Pune,170,BURGLARY,49,F,Firearm,Other Crime,1,Yes,29-04-2020 05:00,Senior,1
4,5,01-01-2020 21:00,01-01-2020 04:00,01-01-2020 16:51,Pune,421,VANDALISM,30,F,Other,Other Crime,18,Yes,08-01-2020 21:00,Adult,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40155,40156,01-08-2024 16:00,07-31-2024 03:00,31-07-2024 05:05,Kolkata,312,COUNTERFEITING,78,F,Firearm,Other Crime,12,No,NaN,Senior,0
40156,40157,31-07-2024 14:00,07-31-2024 04:00,31-07-2024 04:14,Mumbai,300,ILLEGAL POSSESSION,75,F,NaN,Other Crime,2,Yes,29-09-2024 14:00,Senior,1
40157,40158,02-08-2024 03:00,07-31-2024 05:00,31-07-2024 21:33,Kanpur,423,VEHICLE - STOLEN,68,M,Other,Violent Crime,6,No,NaN,Senior,0
40158,40159,01-08-2024 19:00,07-31-2024 06:00,31-07-2024 11:05,Patna,311,SEXUAL ASSAULT,11,M,Blunt Object,Violent Crime,1,No,NaN,Minor,0
40159,40160,31-07-2024 17:00,07-31-2024 07:00,31-07-2024 17:19,Delhi,193,DOMESTIC VIOLENCE,43,F,Poison,Violent Crime,7,Yes,28-09-2024 17:00,Senior,1